from SoloLearn

In [ ]:
INSERT INTO Animals
VALUES ('Slim' ,'Giraffe' ,1);
SELECT Animals.name, Animals.type, Countries.country
FROM Animals, Countries
WHERE Countries.id=Animals.country_id
Order By country;

Your Output
name,type,country Bert,Tiger,India Candy,Elephant,India Vova,Bear,Russia Slim,Giraffe,USA Merlin,Lion,USA Pop,Horse,USA

form Praktikum

In [ ]:
SELECT 
    name, 
    author 
FROM 
    books
WHERE 
    author = 'Эрих Мария Ремарк';--Строки, как в Python, заключают в кавычки

In [ ]:
SELECT
    *
FROM
    название_таблицы
WHERE
    условие_1
    AND условие_2;

--Выбираются строки, которые соответствуют сразу обоим условиям
SELECT
    *
FROM
    название_таблицы
WHERE
    условие_1
    OR условие_2;

--Выбираются строки, которые соответствуют хотя бы одному из условий
SELECT
    *
FROM
    название_таблицы
WHERE
    условие_1
    AND NOT условие_2;

--Выбираются строки, которые соответствуют условию_1 и не соответствуют условию_2

In [ ]:
SELECT
    name,
    author,
    date_pub,
    price
FROM
    books
WHERE
    date_pub > '1990-12-31'
    AND date_pub < '2001-01-01';


/* границы дат в условие не включены, 
чтобы выбрать все дни с 1991 по 2000 годы,
мы взяли последний день 1990 года
и первый день 2001 года */

В отличие от предыдущего кода, границы диапазона в BETWEEN включены в результирующую выборку:

In [ ]:
SELECT
    name,
    pub_name
FROM
    books
WHERE
    pub_name IN ('АСТ', 'ЛитРес', 'Росмэн', 'Эксмо');

In [ ]:
SELECT  
    name, 
    pub_name 
FROM 
    books
WHERE 
    pub_name NOT IN ('АСТ','ЛитРес','Росмэн','Эксмо');

Если в списке должны быть числа, их указывают через запятую: IN (3,7,9). Строки тоже через запятую, но в одинарных кавычках: IN ('значение_1','значение_2','значение_3'). Дату и время обозначают так: IN ('ГГГГ-мм-дд','ГГГГ-мм-дд')

In [ ]:
SELECT
    name,
    price,
    name_store,
    date_upd
FROM
    products_data_all
WHERE
    category = 'молоко и сливки'
    AND
    date_upd IN('2019-06-08', '2019-06-15', '2019-06-22', '2019-06-29');

In [ ]:
SELECT
    COUNT(*) AS cnt
FROM
    products_data_all;

In [ ]:
SELECT
    COUNT(*) AS cnt
FROM
    books
WHERE
    author = 'Эрих Мария Ремарк';

В зависимости от задачи количество строк считают по-разному:
COUNT(*) возвращает общее количество строк в таблице;
COUNT(column) возвращает число строк в столбце column;
COUNT(DISTINCT column) (англ. distinct, «отдельный, особый») возвращает количество уникальных строк в столбце column.

In [ ]:
SELECT
    COUNT(*) AS cnt,
    COUNT(rating) AS author_cnt,
    COUNT(DISTINCT rating) AS author_uniq_cnt
FROM
    books;

In [ ]:
SELECT
    SUM(price) AS summa
FROM
    books;

In [ ]:
SELECT
    AVG(price) AS average
FROM
    books;

In [ ]:
SELECT
    AVG(price) AS average
FROM
    products_data_all
WHERE
    name='Молоко пастеризованное Домик в деревне 2,5%, 930 мл'
    AND name_store='Семёрочка';

In [ ]:
SELECT
    MAX(price)-MIN(price) AS max_min_diff
FROM
    products_data_all
WHERE
    name='Масло топленое Ecotavush 99%, 500 г'
    AND name_store='ВкусМилк';

In [ ]:
Числовые типы данных
integer — целочисленный тип, аналогичный типу int в Python. В PostgreSQL диапазон целых чисел от -2147483648 до 2147483647.
real — число с плавающей точкой, как float в Python. Точность числа типа real до 6 десятичных разрядов.
Строковые типы данных
'Практикум' — значение строкового типа, в SQL запросе его заключают в одинарные кавычки.
varchar(n) — строка переменной длины, где n — ограничение. Этот тип данных похож на string в Python, но в отличие от него ограничен по длине: в поле можно занести любую строку короче, чем n символов.
text — строка любой длины. Полный аналог string в Python.
Дата и время
Любые вводимые значения даты или времени заключают в одинарные кавычки.
timestamp — дата и время. Этот тип аналогичен datetime в Pandas. В формате timestamp чаще всего хранят события, происходящие несколько раз за день. Например, логи пользователей сайта.
date — дата.
Логический
boolean — логический тип данных. В PostgreSQL есть три варианта значений TRUE — «истина», FALSE — «ложь» и NULL — «неизвестно».
Вы изучили распространённые типы данных. Есть и много других. Вы можете познакомиться с ними самостоятельно в документации.

In [ ]:
SELECT
    AVG(pages::integer) AS average
FROM
    books;

SELECT
    AVG(CAST(pages AS integer)) AS average
FROM
    books;

In [ ]:
SELECT
    author,
    COUNT(name) AS cnt
FROM
    books
GROUP BY
    author;

In [ ]:
SELECT
    author,
    rating,
    COUNT(name) AS cnt
FROM
    books
GROUP BY
    author,
    rating;

In [ ]:
SELECT
    author,
    AVG(pages) AS avg_pages,
    MAX(pages) AS max_pages
FROM
    books
GROUP BY
    author;

In [ ]:
SELECT
    name,
    MAX(price) - MIN(price) AS max_min_diff
FROM
    products_data_all
WHERE
    category = 'масло сливочное и маргарин'
    AND date_upd :: date = '2019-06-10'
GROUP BY
    name;

In [ ]:
SELECT
    
    date_upd::date AS update_date,
    category,
    COUNT(category) AS name_cnt
FROM
    products_data_all
WHERE
    date_upd::date='2019-06-05'
GROUP BY
    update_date,
    category    
ORDER BY
    name_cnt;

In [ ]:
SELECT
    
    date_upd::date AS update_date,
    name_store,
    category,
    COUNT(DISTINCT name) AS uniq_name_cnt
FROM
    products_data_all
WHERE
    name_store='Lentro'
    AND date_upd::date='2019-06-30'
GROUP BY
    category,
    update_date,
    name_store
ORDER BY
    uniq_name_cnt DESC;

In [ ]:
SELECT
    name,
    MAX(price) AS max_price
FROM
    products_data_all
GROUP BY
    name
    
ORDER BY
    max_price DESC
LIMIT
5;

In [ ]:
SELECT
    interviews_ft.panelist_id,
    MAX(points_dm.points)
FROM
    interviews_ft 
    INNER JOIN points_dm on points_dm.interview_id = interviews_ft.interview_id
GROUP BY
    interviews_ft.panelist_id
ORDER BY
    points_dm.points DESC
LIMIT 
    3;

In [ ]:
SELECT
    COUNT(panelist_dm.panelist_id),
    AVG(points_dm.interview_id)
    panelist_dm.country
FROM
    interviews_ft 
    INNER JOIN points_dm on points_dm.interview_id = interviews_ft.interview_id
    INNER JOIN panelist_dm on interviews_ft.panelist_id = panelist_dm.panelist_id
GROUP BY
    panelist_dm.panelist_id,
    points_dm.interview_id,
    panelist_dm.country

In [ ]:
SELECT
   AVG (points_dm.interview_id)
FROM
    interviews_ft 
    INNER JOIN points_dm on points_dm.interview_id = interviews_ft.interview_id
GROUP BY
    points_dm.interview_id

In [ ]:
SELECT COUNT(flights.flight_id) AS flights_amount,
       CASE
           WHEN model LIKE 'Airbus%' THEN 'Airbus'
           WHEN model LIKE 'Boeing%' THEN 'Boeing'
           ELSE 'other'
       END AS type_aircraft
FROM aircrafts
INNER JOIN flights ON flights.aircraft_code = aircrafts.aircraft_code
WHERE CAST(flights.departure_time AS date) BETWEEN '2018-09-01' AND '2018-09-30'
GROUP BY type_aircraft;

In [ ]:
SELECT name,
 CASE
  WHEN imdb_rating > 8 THEN 'Fantastic'
  WHEN imdb_rating > 6 THEN 'Poorly Received'
  ELSE 'Avoid at All Costs'
 END AS 'Review'
FROM movies;

% Wildcard
The % wildcard can be used in a LIKE operator pattern to match zero or more unspecified character(s). The given query will match any movie that begins with The, followed by zero or more of any characters.

In [ ]:
SELECT name
FROM movies
WHERE name LIKE 'The%';

_ Wildcard
The _ wildcard can be used in a LIKE operator pattern to match any single unspecified character. The given query will match any movie which begins with a single character, followed by ove.

In [ ]:
SELECT name
FROM movies
WHERE name LIKE '_ove';

In [ ]:
SELECT COUNT(*)

In [ ]:
SELECT SUM(downloads)
FROM fake_apps;

In [ ]:
SELECT ROUND(AVG(price), 2)
FROM fake_apps;

In [ ]:
SELECT price, COUNT(*) 
FROM fake_apps
WHERE downloads > 20000
GROUP BY price;

In [ ]:
SELECT category, 
   price,
   AVG(downloads)
FROM fake_apps
GROUP BY category, price;

In [ ]:
SELECT category, 
   price,
   AVG(downloads)
FROM fake_apps
GROUP BY 1, 2;

In [ ]:
SELECT price, 
   ROUND(AVG(downloads)),
   COUNT(*)
FROM fake_apps
GROUP BY price
HAVING COUNT(*) > 10

In [ ]:
SELECT shirts.shirt_color,
   pants.pants_color
FROM shirts
CROSS JOIN pants;

In [ ]:
SELECT COUNT(DISTINCT user_id) AS 'enrollments',
  COUNT(CASE
       	WHEN strftime("%m", cancel_date) = '03'
        THEN user_id
  END) AS 'march_cancellations',
 	ROUND(100.0 * COUNT(CASE
       	WHEN strftime("%m", cancel_date) = '03'
        THEN user_id
  END) / COUNT(DISTINCT user_id)) AS 'churn_rate'
FROM pro_users
WHERE signup_date < '2017-04-01'
	AND (
    (cancel_date IS NULL) OR
    (cancel_date > '2017-03-01')
  );

In [ ]:
SELECT CASE
   WHEN url LIKE '%github%' THEN 'GitHub'
   WHEN url LIKE '%medium.com%' THEN 'Medium'
   WHEN url LIKE '%nytimes.com%' THEN 'New York Times'
   ELSE 'Other'
  END AS 'Source',
  COUNT(*)
FROM hacker_news
GROUP BY 1;

In [ ]:
SELECT timestamp,
   strftime('%H', timestamp)
FROM hacker_news
GROUP BY 1
LIMIT 20;

This returns the hour, HH, of the timestamp column!

For strftime(__, timestamp):

%Y returns the year (YYYY)
%m returns the month (01-12)
%d returns the day of the month (1-31)
%H returns 24-hour clock (00-23)
%M returns the minute (00-59)
%S returns the seconds (00-59)
if timestamp format is YYYY-MM-DD HH:MM:SS.

In [ ]:
SELECT strftime('%H', timestamp) AS 'Hour',
 ROUND(AVG(score), 2) AS avg_score, 
 COUNT(*) AS 'number of stories'
FROM hacker_news
WHERE timestamp IS NOT NULL
GROUP BY 1
ORDER BY 2 DESC;

In [ ]:
SELECT COUNT(DISTINCT user_id) AS enrollments,
	COUNT(CASE
       	WHEN strftime("%m", cancel_date) = '03'
        THEN user_id
  END) AS march_cancellations,
 	ROUND(100.0 * COUNT(CASE
       	WHEN strftime("%m", cancel_date) = '03'
        THEN user_id
  END) / COUNT(DISTINCT user_id)) AS churn_rate
FROM pro_users
WHERE signup_date < '2017-04-01'
	AND (
    (cancel_date IS NULL) OR
    (cancel_date > '2017-03-01')
  );